// 주석 : 실행되지 않는 구역 # 코드 설명 # 학습용 , 현업용
//      1. //       : 한줄주석
//      2. /* */    : 여러줄 주석

/*
    java 파일이란?? 자바 코드를 작성할수 있는 .java 확장자 파일 , STEP1.java
    java 파일 만드는 방법 ?? java파일을 생성하고 싶은 상위 폴더를 오른쪽 클릭 -> new -> java class # java파일( class코드 포함 )
    class 이란?? (추후에 학습) 자바는 컴파일(번역) 단위를 class 단위로 한다. # class 밖에 있는 코드는 번역하지 않는다.
        # 자바코드는 무조건 class { } 안에서 작성한다.
    main 함수란?? 스레드가 기본적으로 내장된 함수 # 스레드란 : 번역된 코드를 읽어드리고 수행하는 흐름
        # 실행할 코드는 무조건 main{ } 안에서 작성한다. # 또한 자바의 실행의 시작은 main 부터 시작된다.

    실행( 컴파일 --> 컴파일된파일 --> main함수 실행 )
        방법1 : 파일의 아무곳이나 오른쪽 클릭 -> run (실행) 클릭
        방법2 : ctrl+shift+f10
        방법3 : 상단 메뉴 -> [ run ] -> [ run ]
*/
package day02; // 현재 java 파일이 위치한 폴더명
public class STEP1 { // class start  // ---------------- 컴파일이 번역하는 구역 ---------- //

    // main + 엔터 : main함수(스레드 포함) : 번역된 코드을 읽어드리는 함수/기능 이다.
    public static void main(String[] args) { // ------------------- 컴파일된 코드를 읽어서 수행/실행 되는 구역 -------//

    } // ------------------- --------------------------------- -------//

} // class end  // ---------------- ---------------------------- //
